; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v7)
             (pred_7 ?v10 ?v6)
             (pred_2 ?v5 ?v6)
             (pred_12 ?v13 ?v5 )
	     (pred_6 ?v5)
             (pred_4 ?v9)
             (pred_3 ?v10)
             (pred_11 ?v6)
             (pred_8 ?v5)
             (pred_5 ?v10)
             (pred_10 ?v5)
             (pred_1 ))



(:action op_5
:parameters (?v3 ?v2 ?v11 ?v1)
:precondition (and (pred_4 ?v3) (pred_4 ?v2) (pred_3 ?v11) (pred_11 ?v1)
          (pred_9 ?v3 ?v2) (pred_7 ?v11 ?v1)
                   (pred_2 ?v2 ?v1) (pred_6 ?v3) 
                   (pred_8 ?v2) (pred_5 ?v11))
:effect (and  (pred_10 ?v2) (not (pred_8 ?v2))))


(:action op_1
:parameters (?v3 ?v12)
:precondition (and (pred_4 ?v3) (pred_4 ?v12)
               (pred_6 ?v3) (pred_9 ?v3 ?v12) (pred_10 ?v12))
:effect (and (pred_6 ?v12) (not (pred_6 ?v3))))

(:action op_3
:parameters (?v3 ?v11)
:precondition (and (pred_4 ?v3) (pred_3 ?v11) 
                  (pred_6 ?v3) (pred_12 ?v11 ?v3) (pred_1 ))
:effect (and (pred_5 ?v11)
   (not (pred_12 ?v11 ?v3)) (not (pred_1 ))))


(:action op_2
:parameters (?v3 ?v8 ?v4)
:precondition (and (pred_4 ?v3) (pred_3 ?v8) (pred_3 ?v4)
                  (pred_6 ?v3) (pred_5 ?v4) (pred_12 ?v8 ?v3))
:effect (and (pred_5 ?v8) (pred_12 ?v4 ?v3)
        (not (pred_5 ?v4)) (not (pred_12 ?v8 ?v3))))

(:action op_4
:parameters (?v3 ?v11)
:precondition (and (pred_4 ?v3) (pred_3 ?v11) 
                  (pred_6 ?v3) (pred_5 ?v11))
:effect (and (pred_1 ) (pred_12 ?v11 ?v3) (not (pred_5 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_03 obj_17 obj_01 obj_16 obj_15 obj_07 obj_10 obj_13 obj_12 obj_04 obj_06 obj_20 obj_02 obj_05 obj_11
    obj_19 obj_08
    obj_18 obj_14
    )

    (:init
       (pred_1)

       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_4 obj_17)
       (pred_4 obj_01)
       (pred_4 obj_16)
       (pred_4 obj_15)
       (pred_4 obj_07)
       (pred_4 obj_10)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_04)
       (pred_4 obj_06)
       (pred_4 obj_20)
       (pred_4 obj_02)
       (pred_4 obj_05)
       (pred_4 obj_11)
       (pred_11 obj_19)
       (pred_11 obj_08)
       (pred_3 obj_18)
       (pred_3 obj_14)

       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_03 obj_15)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_17 obj_03)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_16 obj_13)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_15 obj_07)
       (pred_9 obj_15 obj_03)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_15)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_13 obj_20)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_13 obj_16)
       (pred_9 obj_12 obj_02)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_04 obj_12)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_20 obj_13)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_02 obj_12)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_16)
       (pred_2  obj_01 obj_19)
       (pred_2  obj_16 obj_08)
       (pred_10 obj_09)
       (pred_10 obj_03)
       (pred_10 obj_17)
       (pred_10 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_10 obj_13)
       (pred_10 obj_12)
       (pred_10 obj_04)
       (pred_10 obj_06)
       (pred_10 obj_20)
       (pred_10 obj_02)
       (pred_10 obj_05)
       (pred_10 obj_11)

       (pred_7  obj_18 obj_19)
       (pred_7  obj_14 obj_08)
       (pred_12 obj_18 obj_05)
       (pred_12 obj_14 obj_10)
       (pred_6 obj_03)
    )

    (:goal (and
       (pred_12 obj_14 obj_02)
    ))
(:constraints
  (always (not (pred_6 obj_07)))
)
)

; plan
1. (op_1 obj_03 obj_15)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_15)
   goals met: 0 of 1
2. (op_1 obj_15 obj_12)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_12)
   goals met: 0 of 1
3. (op_1 obj_12 obj_04)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_04)
   goals met: 0 of 1
4. (op_1 obj_04 obj_06)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_06)
   goals met: 0 of 1
5. (op_1 obj_06 obj_10)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_10)
   goals met: 0 of 1
6. (op_3 obj_10 obj_14)
   deleted: (pred_12 obj_14 obj_10) (pred_1)
   added: (pred_5 obj_14)
   goals met: 0 of 1
7. (op_1 obj_10 obj_06)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_06)
   goals met: 0 of 1
8. (op_1 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 0 of 1
9. (op_1 obj_04 obj_12)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_12)
   goals met: 0 of 1
10. (op_1 obj_12 obj_02)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_02)
   goals met: 0 of 1
11. (op_4 obj_02 obj_14)
   deleted: (pred_5 obj_14)
   added: (pred_1) (pred_12 obj_14 obj_02)
   goals met: 1 of 1
